[{"course_code": "CSC111", "course_desc": "\"Fundamentals of computer programming with real-world engineering examples using an imperative programming language. Topics include variables, data types, statements, control structures, functions, parameter passing mechanisms, expressions, data structures, files, pointers, storage allocation, elementary searching and sorting, recursion, encapsulation, modularity, incremental development, testing and debugging.\"", "course_name": "Fundamentals of Programming with Engineering Applications", "fall_peng_req": true, "fall_req": false, "id": "04eaba1d-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": true, "spring_req": false, "summer_peng_req": true, "summer_req": true, "year_req": 1}, {"course_code": "CSC115", "course_desc": "\"Techniques, methods, and tools for systematic development and maintenance of software systems and documentation; basic algorithms and data structures; and fundamental concepts of object-oriented programming. Topics include control and data abstraction, modularization, abstract data types, layers of abstraction, information hiding, separation of concerns, type checking, program design, separate compilation, software libraries, techniques for the development of high-quality software components, program understanding.\"", "course_name": "Fundamentals of Programming II", "fall_peng_req": true, "fall_req": false, "id": "04ead623-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": true, "spring_req": false, "summer_peng_req": true, "summer_req": false, "year_req": 1}, {"course_code": "CSC225", "course_desc": "\"Basic techniques for design, analysis, implementation of algorithms and data structures. Foundations: Random access machine model, time and space complexity, worst-case analysis, upper and lower bounds. Proof techniques for algorithm correctness. Basic data structures: stacks, queues, linked lists. Sorting: elementary sorting algorithms, mergesort, quicksort, priority queues. Searching: Binary search trees, balanced search trees, hash tables. Graphs: undirected and directed graphs, graph traversals and applications, topological sort. Algorithm design techniques: greedy, backtracking, divide and conquer.\"", "course_name": "Algorithms and Data Structures I", "fall_peng_req": true, "fall_req": false, "id": "04eadc47-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": true, "spring_req": false, "summer_peng_req": true, "summer_req": false, "year_req": 2}, {"course_code": "CSC226", "course_desc": "\"Advanced techniques for design, analysis, and implementation of algorithms and data structures with an introduction to algorithm engineering. Algorithmic design paradigms: greedy, divide-and-conquer, dynamic programming, backtracking, branch and bound. Advanced Analysis techniques, such as amortization. Advanced data structures: hashing, disjoint sets. Advanced graph algorithms: network flow, connectivity, minimum spanning trees, shortest paths. Mathematical tools: graphs and digraphs, graph properties, planar graphs, networks; discrete probability, counting techniques, recurrences.\"", "course_name": "Algorithms and Data Structures II", "fall_peng_req": true, "fall_req": false, "id": "04eaddcb-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": true, "spring_req": false, "summer_peng_req": true, "summer_req": false, "year_req": 3}, {"course_code": "CSC230", "course_desc": "\"The architecture of computer systems including concepts such as CPU, memory, buses, I/O, cache, instruction sets, interrupt processing, pipelining, performance. Families of processors, CISC, RISC. Memory organization and management (including virtual memory, protection, segmentation and paging). Computer arithmetic. The use of assemblers, linkers and loaders. Assembly language programming and its interface with a high-level language (C).\"", "course_name": "Introduction to Computer Architecture", "fall_peng_req": false, "fall_req": false, "id": "04eadf93-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": true, "spring_req": false, "summer_peng_req": true, "summer_req": false, "year_req": 2}, {"course_code": "SENG265", "course_desc": "\"Fundamentals of computer programming with real-world engineering examples using an imperative programming language. Topics include variables, data types, statements, control structures, functions, parameter passing mechanisms, expressions, data structures\"", "course_name": "Software Development Methods", "fall_peng_req": false, "fall_req": false, "id": "04eae0c7-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": true, "spring_req": false, "summer_peng_req": true, "summer_req": false, "year_req": 2}, {"course_code": "SENG275", "course_desc": "\"An introduction to the testing of large-scale systems. Software specification, unit testing, integration testing, test driven development, black box testing, code inspection, model-based testing, software defect tracking and tools for automated testing. A software project gives experience with larger scale testing, including basic database operations.\"", "course_name": "Software Testing", "fall_peng_req": true, "fall_req": true, "id": "04eae1af-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": true, "spring_req": false, "summer_peng_req": false, "summer_req": false, "year_req": 2}, {"course_code": "CSC320", "course_desc": "\"A survey of formal models and results that form the theoretical foundations of computer science; typical topics include finite automata, Turing machines, undecidable problems, context free languages and computational complexity.\"", "course_name": "Foundations of Computer Science", "fall_peng_req": true, "fall_req": false, "id": "04eae285-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": true, "spring_req": false, "summer_peng_req": true, "summer_req": false, "year_req": 3}, {"course_code": "CSC360", "course_desc": "\"The major concepts of operating systems and study of the interrelationships between the operating system and the architecture of computer systems. Topics discussed include operating system structures, concurrent programming techniques, cpu scheduling, deadlocks, memory management, file systems and protection.\"", "course_name": "Operating Systems", "fall_peng_req": false, "fall_req": false, "id": "04eaebd0-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": true, "spring_req": false, "summer_peng_req": true, "summer_req": false, "year_req": 3}, {"course_code": "CSC361", "course_desc": "\"An introduction to concepts in computer communication and networks. Topics include layered network architectures, packet switching networks, local area networks, protocol design and network security.\"", "course_name": "Computer Communications and Networks", "fall_peng_req": true, "fall_req": false, "id": "04eaedbd-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": false, "spring_req": false, "summer_peng_req": true, "summer_req": true, "year_req": 3}, {"course_code": "CSC370", "course_desc": "\"The use and operating principles of database management systems. Topics include: data entities and relationships; data modelling using Entity-Relation Diagrams: hierarchical, network and relational models of databases; query languages; physical representation of data in secondary storage; relational algebra and calculus as applied to the design of databases; security and integrity in the context of concurrent use; and basic ethical issues associated with database design and use.\"", "course_name": "Database Systems", "fall_peng_req": true, "fall_req": false, "id": "04eaee63-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": true, "spring_req": false, "summer_peng_req": true, "summer_req": false, "year_req": 3}, {"course_code": "SENG310", "course_desc": "\"Understanding human behaviour as it applies to user interfaces: work activity analysis, observational techniques, questionnaire administration and unobtrusive measures. Operating parameters of the human cognitive system, task analysis and cognitive modelling techniques and their application to designing interfaces. Interaction design principles and prototyping techniques. Evaluation techniques including cognitive walkthroughs, usability studies and verbal protocol analysis are used to evaluate interface design. Case studies of specific user interfaces.\"", "course_name": "Human Computer Interaction", "fall_peng_req": true, "fall_req": false, "id": "04eaf1e9-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": true, "spring_req": false, "summer_peng_req": true, "summer_req": false, "year_req": 2}, {"course_code": "SENG321", "course_desc": "\"Combines a range of topics integral to the analysis of requirements, design, implementation, and testing of a medium-scale software system with the practical experience of implementing such a project as a member of a software engineering team. Introduces requirements engineering, specifications, software life cycle models and methods for requirements engineering.\"", "course_name": "Requirements Engineering", "fall_peng_req": false, "fall_req": false, "id": "04eaf29f-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": false, "spring_req": false, "summer_peng_req": false, "summer_req": true, "year_req": 3}, {"course_code": "SENG371", "course_desc": "\"Introduces problems and solutions of long-term software maintenance/evolution and large-scale, long-lived software systems. Topics include software engineering techniques for programming-in-the-large, programming-in-the-many, legacy software systems, software architecture, software evolution, software maintenance, reverse engineering, program understanding, software visualization, advanced issues in object-oriented programming, design patterns, antipatterns, and client-server computing. Culminates in a team project.\"", "course_name": "Software Evolution", "fall_peng_req": false, "fall_req": true, "id": "04eaf32c-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": false, "spring_req": false, "summer_peng_req": false, "summer_req": true, "year_req": 3}, {"course_code": "SENG350", "course_desc": "\"An introduction to analysis and design of software architectures with architecture description languages and their subsequent synthesis at the program level. Topics include requirements analysis, analysis and design of static and dynamic view points of architectures and model driven engineering. Architectural styles and tactics are introduced and applied as solutions to recurring design problems. Students are familiarized with component reuse, event-driven programming and computer-aided software engineering tools. The course includes a major design project.\"", "course_name": "Software Architecture and Design", "fall_peng_req": true, "fall_req": false, "id": "04eaf3bd-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": true, "spring_req": false, "summer_peng_req": true, "summer_req": true, "year_req": 3}, {"course_code": "SENG360", "course_desc": "\"Topics include basic cryptography, security protocols, access control, multilevel security, physical and environmental security, network security, application security, e-services security, human aspects and business continuity planning. Discusses applications which need various combinations of confidentiality, availability, integrity and covertness properties; mechanisms to incorporate and test these properties in systems. Policy and legal issues are also covered.\"", "course_name": "Security Engineering", "fall_peng_req": true, "fall_req": false, "id": "04eaf450-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": true, "spring_req": false, "summer_peng_req": true, "summer_req": true, "year_req": 3}, {"course_code": "ECE255", "course_desc": "\"The architecture of computer systems including concepts such as processor, memory, buses, input/output, instruction sets, interrupt processing, pipelining, performance. Families of processors, CISC, RISC. Memory organization and management including cache, virtual memory, protection. Computer arithmetic. Assembly language programming, assemblers, linkers and loaders. Hardware/software interaction.\"", "course_name": "Introduction to Computer Architecture", "fall_peng_req": false, "fall_req": false, "id": "04eaf71e-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": false, "spring_req": false, "summer_peng_req": false, "summer_req": true, "year_req": 2}, {"course_code": "ECE260", "course_desc": "Continuous-time signals and systems. Signal properties and basic signal transformations. Elementary functions including the Dirac delta function. System properties. Linear time-invariant systems and convolution. The Fourier series in the analysis of periodic signals. The Fourier transform and spectral analysis. The Laplace transform and its use in system analysis. The relationship between the Fourier and Laplace transforms. Solving differential equations with the Laplace transform. Partial fraction expansions. Using computer simulation of dynamic systems.", "course_name": "Continuous-Time Signals and Systems", "fall_peng_req": false, "fall_req": false, "id": "04eb054b-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": false, "spring_req": false, "summer_peng_req": false, "summer_req": false, "year_req": 2}, {"course_code": "ECE310", "course_desc": "Discrete-time signals and systems. Signal properties and basic signal transformations. System properties. Linear time-invariant systems and convolution. Discrete-time Fourier series. The Fourier transform and spectral analysis. The z transform and its use in system analysis. The relationship between the Fourier and z transforms. Sampling. Analysis and design of discrete-time systems. Solving difference equations with the z transform.", "course_name": "Digital Signal Processing I", "fall_peng_req": false, "fall_req": true, "id": "04eb0690-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": false, "spring_req": false, "summer_peng_req": false, "summer_req": false, "year_req": 2}, {"course_code": "ECE355", "course_desc": "\"Processor organization: general-purpose and application-specific processors, datapath and control implementation, pipelining concepts. Memory organization: static and dynamic semiconductor memory, optical and magnetic memory, memory hierarchy and caches. I/O organization: physical and logic interfaces, interrupts and interrupt services routines, direct memory access (DMA), device drivers. Buses and protocols: bus signalling and arbitration, examples of modern buses, communications protocol concepts. Computer networking: network topologies, protocol stack, examples of modern networks.\"", "course_name": "Microprocessor-Based Systems", "fall_peng_req": false, "fall_req": false, "id": "04eb0797-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": false, "spring_req": false, "summer_peng_req": false, "summer_req": true, "year_req": 3}, {"course_code": "ECE360", "course_desc": "\"Characterization of systems: linearity, time invariance and causality. General feedback theory; time and frequency domain analysis of feedback control systems; Routh-Hurwitz and Nyquist stability criteria; root locus methods; modelling of dc servos; design specifications and system performance; design of PID controllers; lead and lag compensators; introduction to state-space methods.\"", "course_name": "Control Theory and Systems I", "fall_peng_req": false, "fall_req": false, "id": "04eb0886-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": false, "spring_req": false, "summer_peng_req": false, "summer_req": true, "year_req": 3}, {"course_code": "ECE455", "course_desc": "\"Techniques to guarantee the completion of computations by their deadline. Scheduling for periodic and non-periodic tasks. Organization and functionality of real time system software and hardware. Working in teams, students must complete a project involving substantial real time design and implementation, partly based on the knowledge and skills acquired in earlier coursework. Learning outcomes are based on a progress review, presentation, demonstration, and final report of the prototype design.\"", "course_name": "Real Time Computer Systems Design Project", "fall_peng_req": false, "fall_req": true, "id": "04eb0d53-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": false, "spring_req": false, "summer_peng_req": false, "summer_req": true, "year_req": 4}, {"course_code": "ECE458", "course_desc": "\"Introduction to communication networking principles and engineering including resource management, error control, flow control, congestion control, TCP/IP model, algorithm and protocol design for wireless and wired communication networks.\"", "course_name": "Communication Networks", "fall_peng_req": false, "fall_req": true, "id": "04eb0e78-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": false, "spring_req": false, "summer_peng_req": false, "summer_req": true, "year_req": 3}, {"course_code": "SENG426", "course_desc": "\"An integral facet of software development, from requirements through delivery and maintenance. The principles of modern software engineering practices, such as DevOps and Site Reliability Engineering (SRE), with an emphasis on automation, continuous delivery and deployment. Topics include planning and achieving quality assurance goals such as reliability, security, performance and scalability for complex software systems.\"", "course_name": "Software Quality Engineering", "fall_peng_req": false, "fall_req": true, "id": "04eb0f0c-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": false, "spring_req": false, "summer_peng_req": false, "summer_req": false, "year_req": 4}, {"course_code": "SENG440", "course_desc": "\"Characteristics and design of embedded systems. Formal models and specification languages for capturing system behaviour. Techniques for specification, exploration and refinement. System partitioning and hardware/software co-design. Tools for validation, verification and simulation. Quality and performance metrics.\"", "course_name": "Embedded Systems", "fall_peng_req": false, "fall_req": true, "id": "04eb0f93-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": false, "spring_req": false, "summer_peng_req": false, "summer_req": false, "year_req": 4}, {"course_code": "SENG499", "course_desc": "\"Students are required to pursue a team-based project under the supervision of a faculty member, to prepare a written report and present a seminar describing the work. Projects normally focus on large software systems, and collaboration with an industrial sponsor is encouraged.\"", "course_name": "Design Project II", "fall_peng_req": false, "fall_req": true, "id": "04eb100f-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": false, "spring_req": false, "summer_peng_req": false, "summer_req": false, "year_req": 4}, {"course_code": "SENG401", "course_desc": "\"Introduces students to the larger societal context across Software Engineering and Computer Science. Topics include: the impact of software and hardware systems on privacy and handling of personal and proprietary information; the roles of encryption and interception of communication; trust in computers; democracy, free speech and civil discourse; intellectual property; computer crime; computers in the workplace; professional ethics and responsibilities; sustainable development and environmental stewardship; social ethics and relationships; economic exchange.\"", "course_name": "Social and Professional Issues", "fall_peng_req": true, "fall_req": true, "id": "04eb13ef-00a0-11ed-a8fd-0242ac120002", "prof_prereq": "NULL", "spring_peng_req": true, "spring_req": false, "summer_peng_req": true, "summer_req": true, "year_req": 4}]